Revit 2026 API

# BRepBuilderSurfaceGeometry Methods

---

The BRepBuilderSurfaceGeometry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Construct BRepBuilderSurfaceGeometry based on a permitted Revit Surface. |
|  | CreateNURBSSurface(Int32, Int32, IListDouble, IListDouble, IListXYZ, Boolean, BoundingBoxUV) |  |
|  | CreateNURBSSurface(Int32, Int32, IListDouble, IListDouble, IListXYZ, IListDouble, Boolean, BoundingBoxUV) |  |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

BRepBuilderSurfaceGeometry Class

Autodesk.Revit.DB Namespace